{"architecture":{"class_name":"Functional","config":{"name":"model_1","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"name":"input_layer","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["input_layer",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_2","inbound_nodes":[[["dense_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"f01","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"f01","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"g1","trainable":true,"dtype":"float32","units":1,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"g1","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"f02","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"f02","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Concatenate","config":{"name":"gn","trainable":true,"dtype":"float32","axis":-1},"name":"gn","inbound_nodes":[[["f01",0,0,{}],["g1",0,0,{}],["f02",0,0,{}]]]}],"input_layers":[["input_layer",0,0]],"output_layers":[["gn",0,0]]},"keras_version":"2.10.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[3]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[3],"values":["cr2EP04Zob/JXj2/"]}],"outputs":[{"shape":[3],"values":["+CmJwAYRsDz+V19B"]}]}],"trainable_params":{"dense":{"weights":["O2sFvgpVnL+xPqlAkUcFQBG7sT+aahO+yrzIvTKSJ76rIcm/ykLZv215F79l22i/yTGxvjtdeD9JAiG/Bg5gvwvsEz/JptA/m8nQP4K5Kj/QrC69NC6evzC2BcCB25a8HXq9PKqNCMA+tFDA5XwCvDlYFL/++om+"],"bias":["4S0DP1ReoT1omb4/IZCBvpxTt77Gf9u8HF97vhTduL2IcC2/oXcgPg=="]},"dense_1":{"weights":["inRqvpQq5zz7K9u+VXl9PmuJs74YhyE/YKKOP+7kkb4UPqK+AukBPgYTlr1L+Ss+woxpv0O3Bz8hAh0/D98Xv1enL74b1j+/ts1DPXKMrb6lpDO/cVEZQLlilL+Mghu/k/PsvxiuHL911mC+pFl6vgKStLyINTY/PjoKP6qCqr7szac/7uicv2mS1r5cFU6+mp2ovla8Bj9iu84/7cnmvqjo3D5WgIg/95jQPgTf6L+M7K6/jP8Iv1asjT/SUpY+xsRHP2663j8KI/i+fENKvictLL+1IgK/H2QPP1+tg71dH7y+BlkgvxXYL74TSMe+wjrvPkCSaT8LcPm/6+bsvdUvTj8352U/7ieIvqrB7j4VSCI+AyFhvrttsj/eqQI/GE4Mv6BrST4Kh/w+u5OlvsrRGD5B1LI/tYUGP/NGGr+HP78/u5e9P5ftmT8fWNw+IIC0P8V7C71Gsra/c1EpP4xZvz7ad5q/WJLTvcHNtr6XRlC+v033P4yavT72N1w/HoB9PmN9iD+v+4i/5QkYvw=="],"bias":["no2WvhoRE7+LUOg+K9zIPtyxNL/tDqo+Q6rju/e9bT5NiJe94ngpvg=="]},"dense_2":{"weights":["iFMKQD9rqz8EckU/MIgYwEAmG7/Ok5G+ypyrvgR5m79HKIQ9KEUnPwwnXr5EZxk/8tCJv1+bt77Z6Q69kIoZvms6CD8Ezqy9VEccvxA9JcDjVgY+CML8PlkQqb+2MQE+PhxlP22cGECMEAM/F5CSvuO90TzjPm6/UAeGPnmH1L91O6u+/45WPxMOcj+m/k8/jIKtPz2PaD9Vno8/B57SPc8HVj67AGc/Gp+5P/NHLr9OL1G/aSiIv+ZCYb9qDQM+xMkZv6GnSD8mQTG/g+xaPh1+PsCZOjo9tqiXPuDkXD9YmaY/ZimfvJWegj/+Ap4/6/GSvrDV6jzSuH6/OeSDv6mKG74Fg0g/9bxfP1E/hbyYlYU+ChoxPwkIAEBJw5o+n7okvhvxuj2zUpy/E70Qv7tJMj+9zYI/NWYTP5986L+J9So/1DNCQHwAqD8uMp6/WPdNP67eAMCEKZS/4SSyv4i+Dr/D+oc/o8yiPQXCCr+4oii/cSG6vsr/pj+mDLg/rgcbPd+TBL/T690+2jz7vg=="],"bias":["bfL5PVNOTD5RiIy/WngxPgVn9b3kaCo/wXmTP6KQMb4CPAI/J4jKvw=="]},"f01":{"weights":["AOcpQGyyCr5hGdE/Wr0yQNy9Jb/Ds7K/SuQyvzBP3L8kke6+c7dVPw=="],"bias":["ov7wvg=="]},"g1":{"weights":["ForWP/ag9T8SehS/UKg0P5APh8B1tFo/sXfwP7zrEUCQxDa+MH7+vw=="],"bias":["QTjqPw=="]},"f02":{"weights":["UMXvP8BBHUEb9KtAm6M/wS1nmMDVbajA0s7jwGJTnsDq5BPBVF+3QA=="],"bias":["A620wA=="]}},"hash":"8e5a1531021688dff2d4962a2d985b7454c5e98eb8c343017650d389a492583a"}