{"architecture":{"class_name":"Functional","config":{"name":"model_1","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"name":"input_layer","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["input_layer",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_2","inbound_nodes":[[["dense_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"f01","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"f01","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"g1","trainable":true,"dtype":"float32","units":1,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"g1","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"f02","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"f02","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Concatenate","config":{"name":"gn","trainable":true,"dtype":"float32","axis":-1},"name":"gn","inbound_nodes":[[["f01",0,0,{}],["g1",0,0,{}],["f02",0,0,{}]]]}],"input_layers":[["input_layer",0,0]],"output_layers":[["gn",0,0]]},"keras_version":"2.10.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[3]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[3],"values":["D48mvLPh2D8lwA3A"]}],"outputs":[{"shape":[3],"values":["KgznPgBFaEEBbme+"]}]}],"trainable_params":{"dense":{"weights":["UstBviBPar/xZH0/Cu1ZP/G7EUDJrVG+QwbQv5kHFb8yD7C/88z+vqtlZz/HKdW+6RK/PpyEgT4pWDW+px6uvqkFqr642qE/oDuPP1vvAkB6Vu0+2SdJvu6q5b/zT6k+mB4ivziEmsC3Qky/5DHYP1EQAb/+gN69"],"bias":["theFv9rUSb2eO5s+a0qrviqbLj6TlWE+Gzu7PhDGbr9Ak5O+fns0vw=="]},"dense_1":{"weights":["HageP717kL/VLYY/RPQiv2PbDMCL4IM/5N1Zv4nqF79mSSO8wGwMv0A0XT40m2E+R3jCPgwgCj/e+9k++A23vtYZHz6q8B2/QakgPwMxMD29oXm+y9c4vgDJdL+K9WQ9/9Nlv3JFHD62ne2+zKzLvsiH870m1ac/QPOmvW9SDb866go/C4ESv/03GL90oeC9zVUPvxeIGz+qFxe+upoJPhplaD6LpLo/lU1Dvt8vab/+UVm+CN5UP+WXrT9Ub40/zagqvnUFq72Jw9g+/6rvPfP2Ej4qekW+O7M5P/Hehr4qxPe+xcuwu6TFrD78D50/nhL1PlMkCb8z1yi+yV6Ivkh3Az+lsXM/Mkr4Pr+4ED+qXgo/MTGePyzXfj6svSc/Oujevl5Y972wzvC+KtvvPeN5yD7XzIc+BowYvoSmV78zuVZANy1Iv6RSZD+aigE/puGNv2lDej9cuA2/1tq0vjBSlr46zOo+ZifkPEGWj79H+3s7UO23PBl80b8wGdc+GRIGPTz2jT+OQArAtwT1vg=="],"bias":["s6KMvt4vLr/2TDi+ZH4qvv8M2T1Vbo68rthgPQBI9T4o9oC+d6iRvg=="]},"dense_2":{"weights":["Xoa7PSqvc7+cIY4+/c4gv4m/mr5SUJk/cokdvhsza778tng/zkqAPw5miD5CNmM+kU6Qvj+x9r/Olko+ydkDv1t/ozxzgAG//HdSv7gWWL4XuCG/FDttvlsPuL4IXDs+DW2EvnKfEj97qpo+jlfoPma5jz+siO6/dICWvntNRj6g0zs9FcIzP61zDb8h8cq+xLA7PyZ/rT55NJA/8hQRPtc6yj4ADAw/toCpvWNZDz7qp/K8b0WfvrVn9z6Fy4U+EKuuvugyJD54nBC+G0fdvR5JdL6hKqI/r3HcvksSqj8fRz0+WIHaPpQsrb4K3xBAxJ4Ev+4Hrz6Mc0K/E9Exvmyzhz5pFL6+7+OJP3Mr+T6PG3M/E6ZQQPVHej9dUWm+0OzAPsIaJb+ipb++McbHPi0dA75ISY4+2YiPPpEVOT8shAG/0QcjQDns6b0ig6Q9wMNMP0kPBb8HNAG/kF3QPlSQ2Ly5d4Q+WOF/vXJts74wfxM+KOx0PytCH768hn0/HOUbPqGfSL544js/JBYbvw=="],"bias":["KZKPPhJQ5r3+QQk+6XoKPqfkaL7tthk+l6gmvVP7vT8gj+q+HGqIPw=="]},"f01":{"weights":["KStvP4RpQj9kykU/doaJPXbDcj7oqtW+gENbv2wXjz5z1eO+358GPw=="],"bias":["eR59Pg=="]},"g1":{"weights":["8m3WP0QP67/TjtA/CtQjQAMO/79z4oe/ilp5QPSfxj+Xqbs/h1qnPw=="],"bias":["iySxPw=="]},"f02":{"weights":["Bf4KPqqgcL7nM3a+rmZ5vQXYA797oxg+RYUcPnP3Mb9BvZI+Ie+Cvg=="],"bias":["YqHPvg=="]}},"hash":"b8f63e870c2bf6d935d6f295b340043e4d65be077641f78ead24b2ddd434555b"}