{"architecture":{"class_name":"Functional","config":{"name":"model","trainable":true,"layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_2","inbound_nodes":[[["dense_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_3","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_3","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_4","trainable":true,"dtype":"float32","units":1,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_4","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_5","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_5","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Concatenate","config":{"name":"concatenate","trainable":true,"dtype":"float32","axis":-1},"name":"concatenate","inbound_nodes":[[["dense_3",0,0,{}],["dense_4",0,0,{}],["dense_5",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["concatenate",0,0]]},"keras_version":"2.12.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[3]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[3],"values":["dP6Cv8GMIz++MwC/"]}],"outputs":[{"shape":[3],"values":["pFIHwKV3XEGxFh7C"]}]}],"trainable_params":{"dense":{"weights":["UYMkv6gC5z8IfnI/BLVkv/XjgT+Wu1k+AiKIPyIT5L+7Ute+dDWoPxvVJT+X2rm+i6yRvwd6Zr9BnRu/AgeCP3hdYr+o7rO7tVJtP2xNgT//IuU+JSgxPuKBEz89ZYQ9+UmZQJZIWr4zlqq9bC1NP7HSID9ZR7BA"],"bias":["ANjNvkF4Xr5MMiy+ol4+PiXg+j550uO+aA3GPo4lUb6kTzW+jMxtvg=="]},"dense_1":{"weights":["xrGKu+YkYz9MXJ6+Vkwkv6TVID/rc9Y/46mDvhZsl78w1/w8v8CePR4iTj+QPZq+/uQhQF17ub/bttI+SG+9PvzdcT6ntLS+quYJwMS3gj9CUcY+iDqPv0mOrz+WAy6/fPK6vrbwrb/TRIQ/HVgcPwfkxL+KpKo/jV2FvxdOcb/rVZG/0KODPNIsnr6ZI4O/uFgcPRcKuD1f4xq/tiisPo4c1r6+52Y//dcKvlgZQb3v1KC9ab3BPZEIa7+eBr++TmkKP2bxDj6YSpU/DibyP+2Ghz9zUZc+IiFzP2MTvD4d9de+NFHRvxc3AEC6/z2/gHCePKoi/74g15s/zX4Wv5QG4r9i7rG+6SRkvg+01D4R8b2/cI38P7fVwL5NZga/Zi1cvwE45Lvs55w/PPqlv5lqhT7E5SK77Tf0P4JSR74OCOI+FUHuP7Zjmr6QhcM9OSiqPjVdE0Da7Io+GgzlvjryNb7EE5S+uiXuPlAdBr6C0EO+fwSmv2BTgL8TYSc+nqQZP7YFoL0nUgW+ZI01Pw=="],"bias":["pbjsvUJQhLvb3pa+gdMdvq+fsr5regA/YgGGv6A5Cz8y/8q+4p6CvA=="]},"dense_2":{"weights":["6z0nv6kiBkCU/7+/ULwXwJTExj48XABAcBfMv118vL/g6ok/JFs5QAoJ0j/nd7e9AP/pvclPZz/mc+c+H8cFv8QfKT5AmMO/3aipPoDl3T60f4o+Dnw0P8dco764Yq++BXumP03JaD/uDPa+ZuuBPnnbgD8/4S1ATPPuvjvgRz+of4q/EggyPkyBRz8nPhi9lHB1v28LKDyVfS4/L2uRP6lVQr9t1Jk+zwnevlnynD1emg8/v5svPR/WxL9YGFS+N+NTPjav3r6XF4k/lfE7v43LpT+Xw6o+WxS/vSLaUr9+kEo/UTdGPcNGtj2ZSvG8zQuIv90Mhz87cPm+JLWKvpkMDb8NNmq9Rrlqv1Fpmr4/N0c/Fx60Pv6xHr/ixtY+DQ9lvzGzpz2t2Yc/JZk9v3UewL6nrPM/adVgPy2Rxr25xfi+bpjFP2U3gL8wXfe8zBtEPuTakj83lQK/oo60vQPX3Twr0lo/0GkPvp8dMr/3gwA/TLaQvv+DsL+mGTE//hJhPwYqgj+KlCa/9zYkvw=="],"bias":["iTt2P/p1Yr/5FWk/qiPBPe/78L1gPMy+V9ZmPwcfFT41R82+JhLNug=="]},"dense_3":{"weights":["qICDv29EuD9myGi/3QsPwKQZ3D7EoOy/qcMNvzouE8DdeY49bpGAvg=="],"bias":["e4tWvw=="]},"dense_4":{"weights":["E96jP1XNVb9URIg/lmBOQFTLYUByiMC+51GOP7UZIMC9AxC/IgePPw=="],"bias":["mLqoPw=="]},"dense_5":{"weights":["rsiCwAx8hEAn2YXARzOowJlQAEG3DQdBPxSMwHOAJL+tcv5AidjxQA=="],"bias":["Srl3wA=="]}},"hash":"0a4bf90beb5b4cc7001034158923c48881923915cb71d35bd73e48f49e952eb2"}