{"architecture":{"class_name":"Functional","config":{"name":"model","trainable":true,"layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_2","inbound_nodes":[[["dense_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_3","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_3","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_4","trainable":true,"dtype":"float32","units":1,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_4","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_5","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_5","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Concatenate","config":{"name":"concatenate","trainable":true,"dtype":"float32","axis":-1},"name":"concatenate","inbound_nodes":[[["dense_3",0,0,{}],["dense_4",0,0,{}],["dense_5",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["concatenate",0,0]]},"keras_version":"2.12.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[3]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[3],"values":["2L0DPSXSrb+sy/a9"]}],"outputs":[{"shape":[3],"values":["TEwGQeD8AEAemHDD"]}]}],"trainable_params":{"dense":{"weights":["qRZ8QGThrz9DJ1jAuHQuP002yb5c45g85Rg1vxqqLzxZ/+m/cfjIv4G2w7+OEz6/O3jDP2nmXL+h1lc/Gg5KvzpsoL6xDSE/8QHHvspiD7/ANQS+uOS/vcK9Bb9pnvY9W6ESv6IFmb3272q+42zdPuEgTT4XkF++"],"bias":["CkAWPxk7xDw8zvq+bhrqvHCVC73y6Ms+aJxePg6BGD7tmV4+DWKmPg=="]},"dense_1":{"weights":["lXWsvXE7AED3qXW/T0GAPzRJwj6h5CI9PU2jvhEFR78PtqrAH6BNvz+arL9Bxag/aGQzPrq0Xz/eA9I+8WyKveORbD/h46S/h+YkwKB0A7+YS/a+gpc8Pgqnmz6P6hE/ygHEv/SkHT+08Jy+bsu7Pqxee0D4Q2M/XNm3vudb2r7rq1a+CylCP+/Tu7/rkYy9s9imvxm+CsCouey9Cz2Wvgducj88/ny/T5LzvlM0lL+dP/Y+5v5ivs6kLz9NFSg/NfJrPl4giz8u8Ma+9D0bv1YxN7+2Edu+Y+TCvwFsA7/q+ra+GyWzwKnZTz9ZApu/LzQ6ve9Vsr8OaTq8xfDtvjCbUL8ln8g+m0LWPvFmlr8o8QBA+U4Uv/uxRz/gjY4+BsixvlhhsL5SjWs/HRSGvil/Tz8fEuw+pBGyvydK4j5Px1Q/1QabwHLt7b4hbivA7xWUP/9xJb+RFw2+alJ6v4OdFUH3nEu/5lvpPmbNKcDZsvG9IFijv+ys3j7oLgm/8VWsvyfpCsDDZpdAyGFEvw=="],"bias":["cecbvJXgib8mvD+/GKbfvnP7rD/JQKS+ivWZP1RHl77Pgum+Zr20Pg=="]},"dense_2":{"weights":["yyTEP98asz4lMQnA0iWBvmOn9z7vc2BAZMaAPoD2aT9JLQNAp7yQvx2XBMDIuI2/zzOjP8d4Ub9SLsC+TqLxv2LSoL+xIxm/hEqQPoMOKj+gdYC/EBstv8GzIz9MJes/2tBNvxx7sb8fqL2/w+pPv7tnZ7/p2t69icTLv1sCJL89uBU/zAGjP9Vgo7//qoA+todJvmopPL+MzAa+/Pl4PxSgpz/VMtI+EH4Bv1CpN8DHLow/livMPmjQWz9LJYg/o/DlP8V0mT89/sQ/JuDBvrkqtT4XBwdA76SqvxtpsL8Rk8I+KOckv8QtojxBlYs+mWRlP4aYGD32n0Q/G4PFv+KIbb7ntwi/B8hUP2f0Iz+0oGBAZR4vP0CU7b/yLU+/WqU7PjKxhb8P9q8+5fcOwDdpPr+ZP2o/FjDFP6XRBUD0paI/bq6VP+iRWb9Bplw+bkCKPzZQDkCf0ns/0UKlvSN4rT8vxaW/cJg7v9BGVj9ZPoA/UzkavbT2kL6cpoU/hQbCPVudfr2Wxqc/cOtvOw=="],"bias":["8GdjP9FWIT/RpfC9dtwQwAwVyT6Xshg/+5bpPqcaWj9fvJo/B6j5Pg=="]},"dense_3":{"weights":["LwZIv2KbgL8Clo/AM/4lPkmvAkCzFBLA3vnevgwT7T/c6L6+kLmPwA=="],"bias":["cjlFPg=="]},"dense_4":{"weights":["AzOEwHGMK0FtC6K+FvwmP2rNMkC43oDAbmCpPp5XoT+LUGS/26eoQA=="],"bias":["W5Lfvg=="]},"dense_5":{"weights":["ZqIMwros7cE78ehB0v/kQW4THsInAPXB1T8AwmEuHcKtx+bBHROfwQ=="],"bias":["SDDiwQ=="]}},"hash":"b25293fe20a4a51f7bfdcc64fd8e3dc5dbc9dc3375051422339b59898ad38919"}