{"architecture":{"class_name":"Functional","config":{"name":"model","trainable":true,"layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_2","inbound_nodes":[[["dense_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_3","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_3","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_4","trainable":true,"dtype":"float32","units":1,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_4","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_5","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_5","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Concatenate","config":{"name":"concatenate","trainable":true,"dtype":"float32","axis":-1},"name":"concatenate","inbound_nodes":[[["dense_3",0,0,{}],["dense_4",0,0,{}],["dense_5",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["concatenate",0,0]]},"keras_version":"2.12.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[3]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[3],"values":["gUwwveBBzz6tg6I/"]}],"outputs":[{"shape":[3],"values":["nCmRP3GWEkEwfL3D"]}]}],"trainable_params":{"dense":{"weights":["KlU9v420vr5uvQLAkP7nvqoJJcCtrlu/kbHcvjf4Yb/CmihAeU82v8qtWT00agq+LMeJvlakHUAM28A+e38Lv+hAZjzMNyZAmt4PPxWN/T5jK7++HT4AwJqdoD7PTAO/kxhNvYxCMb7Cz0e+F2vPPvqPCUDQA9S9"],"bias":["njFOPg4ai752XoI9vLQev7Z5mD10IfU+EZ+uvsmj4b56kT2+84I6Pg=="]},"dense_1":{"weights":["JUgMvjX1Pz/1cfm/tjXawJMyz787IPC+1MVxPgJWVD/8aN8/e2vVvpUajj6Woqc//1xvPlwAOb+HCF6/wznSPuUeVD8tnH8/Oh7Qvl3j1z630JG+wIadvyHxBMAbTkPB3B89v4pNdr/us7K+PVEhvki+PUD6DVK/nQkIvYht2j98h4Q/Lfu0P7R6GkBhcWo9WHjxv2+cWb+9oKi+1xQ9P1ne3D94E6bA7LWyP3KTEsGciMo+9hS4PtYZZD9HsHM/TNXvP2r/wb6ovYy/lp5ivx9ktr+wmobA52Dav4Wc0b7pVAFAo41qvq9Vfz/A9gc/1lZAvqaoKMAFV6A/USJNvzpW+Dw4bgI/ypeNPpRXr76B3rU+bBDyPUCACb/ex3BANmOmPpdQiT8WMuc/qnJyPmbZ3b+IxqG+K1f2vnW+wT6qtSw+yjoOPqgKi7/HGZ+/XIz/vgm/T77cNn++v9jGPt7pxT1s7WG/qeHeP+BHpT9NNWs/nZxhwKdDrr7eL0m/4HejPiJkYj4ckY0/nPmQvw=="],"bias":["FBNmPzGBI0CoVV6/2aKHvYrqaL+wjIi+qWAFPateXD5iWpK9GPXUvg=="]},"dense_2":{"weights":["1DVMvhadur988Mq+rycjQEYmQD5I7VK/q9tLvxXaab72j2E975JAPsF2fr7TDvA/bgrtvzkGID+u17A+6p6GPwKtMb8QzVpA7tPtPt02hD8l/pO+hXoIwF3HHUCGtyC/xioSv0ehlz6nW9m/Et/Ov8iOlr54WiK/212zP3Wfjb9T36+8SiYcwEy5FcAMK9a/N5VXP1BaE7+NhMa/1fFQv4yXkz5z/JA+qlWIPdM9Wr8JeY09q5pmvtD6wD5pnYQ+GkQUPw+Qcz8RmZ6/dNYnv9Ow7D+P/vw+hv6/vzhw874zsaE/lrcZv7MhsL+EVJq/dDfNP2g/c79D0rw/MXQ4vwbVZr9RzBI/mwrPPiHPYr9YtAW/SnSAvgTWVsBnWO8/ETtZvxQ1Fb9I30BA05ajv4T0nb/Zws4/lREJP5+EQD/UfQnAqTroP3XBqL7QCE8/iouuP5ClED8m/pG/FuWBPrOnmD/nGzI/X05aQJHnFr8kDbw/bYChP9n4IsAX4m3AM2GCP6EIHz88nAM/17H3vw=="],"bias":["QBbdvrAqqj8pcx7AV2wwP9Dgwb7MyAI/WhYiv3M3nD9y0As/m2T+Pg=="]},"dense_3":{"weights":["Y+lOv1DkgD8SrF2+OwbfP2fZVr9i27Q/ai5ovojOGj9fHTXAT8OQvw=="],"bias":["F62svQ=="]},"dense_4":{"weights":["U3+lQLy/B8D80RTAQAGPQF6PY78iWA7AjiHBvC/tGkDFn8NAgg8ZQA=="],"bias":["0IrpPw=="]},"dense_5":{"weights":["6wYfQhaB/8EgMPhBSJMRwrzbF8KdxwDCsRcVQlIZ+MEAtRDCeI4Hwg=="],"bias":["8+T6wQ=="]}},"hash":"87cd7dbeea98c440e391005988c9102ee18924b795fda8a09db9ae8ce3e5f0d6"}