{"architecture":{"class_name":"Functional","config":{"name":"model","trainable":true,"layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_2","inbound_nodes":[[["dense_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_3","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_3","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_4","trainable":true,"dtype":"float32","units":1,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_4","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_5","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotNormal","config":{"seed":null},"shared_object_id":1},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_5","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Concatenate","config":{"name":"concatenate","trainable":true,"dtype":"float32","axis":-1},"name":"concatenate","inbound_nodes":[[["dense_3",0,0,{}],["dense_4",0,0,{}],["dense_5",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["concatenate",0,0]]},"keras_version":"2.12.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[3]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[3],"values":["SSDUv2wUAsBC+dc+"]}],"outputs":[{"shape":[3],"values":["Xp//P5p7hz8sD9u/"]}]}],"trainable_params":{"dense":{"weights":["gSktv815Fr8o4NY/XOGmPs8czr3CDSG/NCLVvgf9f78giEA/Fg7AvgqJnb9r8ac9vnHHvVJSTr/wzpM/PzQCQD2EWz+s0zu/mOq3PRELmL4w200+lY5eQJ38BL5Om9K+gFi7vmNF4D4DGQG/sb4Pv1MjZL++mcO+"],"bias":["r57WPoD35T4BPYU9DBRTP92dxr1qqFW+7SSSPNbi+j2GcQC9KYDOvg=="]},"dense_1":{"weights":["Bs7fvqhf874VAA+/kgt9vm0yz742gBC91Gr8vj2zD79EQPE+K/5dvmDhl761Ymm9Gz59PZ3a7r6XA58+sOeKP7njUj4tsjO/D9/6O0Z5qb49uD0+RJOSPoqf3T3dL1S/H90xPxMu2rxno4E+fVHkvyk10r7Cg5m+xbf8PH16A8CWZ1q/y51vviftWL++dYO+sBIQP2XVizvOMiY/FcKQv3kOIL3vmqI/zz2JP7khRj8S/ZM+k6ZPvTIaGz8cVnc/+jL0O/RhBj9oYmo8qNLmPtsbkT/oCy2+cO58Pwxhdr/r8Yw+Slv9PcahkT7N/iI/l2xKvWW9zj4v11W80WCaPlpXKz4rK9C+zObPPiq2kT/ViAi++f2mvSD4Wb9Uk4Y8FlPzvmzLhr2Tvi0+pEPMvoLkHj5Uba8+26H+Pge+Kr+8By4/VCBpvfrbR7zdzqm/B6DhPomnob4soeO8guUmvrwjgj4cIdo9AvyhvNJrnb1zq2C/UrIWPkiHxT5o00m/8Zy7PQoU777Dztu+5GCwPg=="],"bias":["KCCzPWfFLr5sK6M+HSzeveOdd77qfRc+0GIEvMaexL3wyJ0+RfhzvA=="]},"dense_2":{"weights":["aAcVv5J8n70fUAE/bxQgP4WG6D6Fc0a/gk65P0YsQb+TYJk+ya4PPzrC1r+sDrK9yJlRPqQlD79d7Wk/lyGRPmUhij7paGm/btM4PxOO3j4Cvpm+TChOP0bYyL5IkUq+S3WVP47MVL6Yuly/OopAvwdRZb4CeMa94SJ0PeRaJr82UkC+JoCRvyIXVr6z5Eo/WHCbP4wxgj+IsTA/3v1Kv+VS5r8yNY+9V0BbvkS5gz6tUQC/W349viIQPz9K0L2+1WoAP5ZbVr9qX06+zjlLP8231z6/4oM+trCGPqQwZr9Usqi/Lok/v6n5oj4BeRg/Mx3cvqEeI78LZvK+kc7NvioogT5P0JE9I6ObPuIbqr8h0qe7lk2Vv0D6zL0qjqe/h7r5vG8NPb9kl3g/UJIVv9D2LT8rx5O90E4xP64FSb/rQ5A/5o+MvmRkOb2OV7a/jl8uP0EFZb8ZT+S/HtMQv5Q4bT2bF26958xEv+KwPz6REhK/gEsfP/LIfT+I8aS/cbyKvkJCr7/l9WG+C84ZPw=="],"bias":["4HefPS06ED+4wE27PsgdvAHx1T4DRR2/8w20v+YdVb/OhN29BoFOPg=="]},"dense_3":{"weights":["48sZP+cYoD760qk/QGr2vrFZ9z5+Oju/vU64vuHKsb4y1AM/kchOPw=="],"bias":["DVQFPg=="]},"dense_4":{"weights":["Nodpv7terr35+Iy/TSpXwHuhoj/iCHK/BFDovwWQhr+Rsp+/rnTRvw=="],"bias":["2V+WPw=="]},"dense_5":{"weights":["/8KIvi1btb5clBc+GxB9vcKDZj7YuY0+OyTQPsDd57xPhp49PdRKvg=="],"bias":["YXIAvw=="]}},"hash":"1426a6fa3c389c47e8bb781c44dd876e8d30c61750426e73a209b8ac0b80c8f6"}