{"architecture":{"class_name":"Functional","config":{"name":"model_2","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"name":"input_layer","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":10,"activation":"gelu","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["input_layer",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":10,"activation":"gelu","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":10,"activation":"gelu","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_2","inbound_nodes":[[["dense_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"f01","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"f01","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"g1","trainable":true,"dtype":"float32","units":1,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"g1","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Dense","config":{"name":"f02","trainable":true,"dtype":"float32","units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"LecunNormal","config":{"seed":7}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"f02","inbound_nodes":[[["dense_2",0,0,{}]]]},{"class_name":"Concatenate","config":{"name":"gn","trainable":true,"dtype":"float32","axis":-1},"name":"gn","inbound_nodes":[[["f01",0,0,{}],["g1",0,0,{}],["f02",0,0,{}]]]}],"input_layers":[["input_layer",0,0]],"output_layers":[["gn",0,0]]},"keras_version":"2.10.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[3]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[3],"values":["DZWdP7Wknj+kzbg7"]}],"outputs":[{"shape":[3],"values":["j5jvP8Qqv0CiiKC/"]}]}],"trainable_params":{"dense":{"weights":["jJYKwJ+wp7+Nnh7ABGAEwFs3HL/DI/0+I0IQPzZ9zb52OTu/IVUwP2e4kj6TXDg/8cRaP/+8pr6f6rC+XOkWPfTB/jxX/DZAvc4wP9Nk8j7yctO/45f6vxohoL2m83u/1EsYP+nrFz9yGaQ9SbJEPvBNz72bLkY+"],"bias":["pMNOv0Afgz58cEk+Ezgpv4y4vj6Fx809AL8ZPxw0+b5rp/29OTunPg=="]},"dense_1":{"weights":["ivjOvo4D674EWeq/6F+xv6HVt7+asqC/gC0Av+iHGT+J06m+bHa/vtyYVD+QjixAIfeKPWjTDL/ErRlAbZkSv39OwD/gmU0++cdVQA7uvr6u4Ry+Hxgav8nr0r7rT1y/Sy6jPzxAn7+59/c+KaKXP/umHr7MdKQ+b+kSvr2ZSL8JJE+/DAv9vszawb9k0kG/Jgquvr2zBj73xjE+HLWIv0N0sz4qHHQ+4oEvP5XfOj8EEZY/UyUCPS0OML/UmTO+S/T8vw8ONT8HYRM/HiI0P/kuiD+lVJM7WeaBvx3uxj5jAvg+nJagvrRTdr9IO6u/SfrFPvB+FD7AdMG+ZLTuPoBV5r4DpOI+ckBMvy4/Ej7AURC/w2w2P3pcBMDcKNO+h99MwMg5iT08sfQ+w58ZvwTnfL9GUlU/no/tvYevbr7Vk+G+4GBovlsqVL86g3G/wy+kPoilkL9Jptu9jzkKP/LNDrtHuBy/dLzXvuY8cr7TILC/51UoP3Mnrz3qUuM+x3xkv+UaID1KoDi+dBzGPg=="],"bias":["m3W9PsTLpjyWuRU+2Lu0PpWVcj4gDFc+7dZ8vppN/z1q33++Ckg9Pw=="]},"dense_2":{"weights":["llfYv4U65L+72LK9sBfjv0SZyr3bnJ4/uhOWv2IM8b4omXI/LJTCv3YA1D7WgKa8rhKSvkIrxD6YedM+AEgDv7UVHD+RXC5AfaALv7/FeT/jh9c+WMlIPxMxQj4QYWY/qvwwP/qPfr/2GBS+bsaHPhaKML/6mam/3XESPozF872lB1k+8X9fvj/wPzsRCeQ+k7cMv5vK9r53Xm8/vq8cPYjlwb0gcrW/+p4tOqqprb0zxD0+Jkm0PvLzDT7Hdqm/6yxsvgiXKz/vs+e+MNWnvv8K1L0yJri+TfWNv+mAhb3QHkY/PtHwvnnpMb+d1gi/6vqYPJ5n6L+ypF+/AvyHv7o1F8CBEiy+HZvAPemsQz+w1qu/TAazPh6iBMCSyY+/IrEOv6tZ8T07lmg++kfkvuXsI8C+nHo/WYOqvi5Nzz4qYVHARR2KPylVSD4FiDQ+nK3jvkPazr6KjS2+KQwhQMOZrb6K1cM/Yv/+voxNE7+jb7e+2M3cPoeaBj+rZfE+gTc/vp6cA793KLY+wh1vPw=="],"bias":["BqUZPuv+Vz56T6M+Rz0YPiN8Lz7slKg+aPDWvrzYvr7EOsY+UpkqPw=="]},"f01":{"weights":["rN3Dv1T0YT9ehIS/E/+bvyaiPr7lBUc/YMRQv06dr7/vW9E+0DVPPg=="],"bias":["g8kfPg=="]},"g1":{"weights":["ieZ6wH753r+IiAjAlPAnQO019z+ueae/urUGwOl7qr895UQ/T6fAPw=="],"bias":["vjqRPw=="]},"f02":{"weights":["p3YaP3te6j7V4QC/DHiJPlpCtL5bATW+iHO6P3PxtT4IMQS/iHuwPQ=="],"bias":["k8d5vg=="]}},"hash":"7228b6c0fd461771939d12a9fbe8859cfbdc2eb434bfe3664ec02c2741964fa5"}